Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དེ་ལྟ་བུའི་སེམས་ཅན་བསམ་པ་དག་པ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་དང་བཅས་པ་དག་གིས་ཀུན་ཏུ་བལྟམ་སྟེ་གཞག་པར་བགྱིའོ།
en: I shall establish a buddha realm that is filled with the kind of beings who have pure thoughts, bodhisattvas with one lifetime remaining. “ ‘

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་གང་བདག་གིས་དང་པོར་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་མ་སྩལ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་མ་བཙུད་པ་དག་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no bodhisattvas there whom I did not cause to aspire to enlightenment and to practice the perfections for the first time.

source: གང་དག་བདག་གིས་དང་པོར་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་བཙུད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དེར་སྐྱེ་བར་གྱུར་ཅིག །
en: May all the bodhisattvas whom I have caused to aspire to enlightenment and practice the perfections for the first time be born there.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡང་དེ་ཉིད་ཀྱི་ཁོངས་སུ་གཏོགས་པར་བགྱི་ཞིང་འདི་དག་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཡང་རབ་ཏུ་ཞི་བར་བགྱིའོ།
en: May I pacify completely the sufferings of all those who are contained within that buddha realm. “ ‘

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བསྒྲུབས་ནས་དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, after I have become a bodhisattva and accomplished those heroic actions, may I attain the complete enlightenment of perfect buddhahood in that buddha realm. “ ‘

source: བདག་གི་བྱང་ཆུབ་ཀྱི་ཤིང་ནི་རིན་པོ་ཆེ་སྣ་བདུན་རྣམ་པར་བཀྲ་བར་སྣང་བ་ཞེས་བགྱི་བར་འགྱུར་ཞིང་། སྦོམས་སུ་ནི་གླིང་བཞི་པ་ཁྲི་མཆིས་པར་གྱུར་ལ། ཁོ་ར་ཁོར་ཡུག་གི་ཁྱོན་ནི་སྟོང་གསུམ་པ་བཅུ་མཆིས་པར་གྱུར་ཅིག །
en: May my Bodhi tree, Saptaratnavicitrasan­darśana, be the size of ten thousand four-continent worlds, and may its circumference be that of ten billion-world universes.

source: བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་དྲི་དང་། འོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་དག་ཁྱབ་པར་གྱུར་ཅིག །
en: May the aroma and light of that Bodhi tree spread throughout the entire buddha realm. “ ‘

source: དེའི་དྲུང་དུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་རྡོ་རྗེའི་གདན་རབ་ཏུ་ཞི་བ་བཟོད་པའི་ཡེ་ཤེས་ཤིན་ཏུ་འབྱེད་པའི་དྲི་ལ་ཡང་དག་པར་གཞོལ་བ་ཞེས་བགྱི་བ་གླིང་བཞི་པ་ལྔའི་ཁྱོན་ཙམ་མཆིས་ལ་འཕང་དུ་ནི་དཔག་ཚད་བརྒྱད་སྟོང་བཞི་བརྒྱ་མཆིས་པར་གྱུར་ཅིག །
en: At the foot of that tree may there be my vajra seat, adorned by various jewels, named Praśamak­ṣamasuvicitra­jñāna­gandha­samavasaraṇa, the size of five four-continent worlds and 84,000 yojanas high. “ ‘

source: བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་དྲུང་དུ་རྡོ་རྗེའི་གདན་ལ་བདག་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས་ཡུད་ཙམ་དེ་ཉིད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དུས་ཀྱི་བར་དུ་སྐྱིལ་མོ་ཀྲུང་དེ་མི་འཇིག་མི་འགྲོལ་བར་འགྱུར་ཞིང་།
en: May I sit cross-legged upon the vajra seat at the foot of the Bodhi tree and in an instant attain the complete enlightenment of perfect buddhahood.

source: བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་དྲུང་ནས་མི་ལྡང་བར་གྱུར་ཅིག །
en: May I remain seated, and not uncross my legs nor get up from under the Bodhi tree until I pass into parinirvāṇa.

source: བདག་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་གནས་ཤིང་རྡོ་རྗེའི་གདན་ལ་མཆིས་བཞིན་དུ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་དག་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་གཞན་དག་ཏུ་འགྱེད་པར་གྱུར་ཅིག །
en: While I remain seated upon the vajra seat at the foot of the Bodhi tree, may I emanate buddhas and bodhisattvas who go to countless other buddha realms.

source: སངས་རྒྱས་རེ་རེས་ཀྱང་སྔ་དྲོ་གཅིག་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་དེ་ཉིད་ཀྱི་སྔ་དྲོ་ལ་ཡང་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩོལ་པ་དང་། རབ་ཏུ་འགོད་པ་དང་། ཕྱིར་མི་ལྡོག་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May each buddha teach the Dharma to beings in the morning and in that morning make countless beings aspire to, be dedicated to, and progress irreversibly toward the highest, most complete enlightenment.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྲུལ་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་བགྱིད་པར་གྱུར་ཅིག །
en: Thus, may my bodhisattva emanations accomplish bodhisattva activities. “ ‘

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་གཞན་དག་ཏུ་ཡང་བདག་གི་ལུས་གདའ་བར་གྱུར་ཅིག །
en: When I have attained enlightenment, may my body be visible in countless other realms in the ten directions.

source: སེམས་ཅན་གང་དག་གི་མིག་གི་དབང་པོས་བདག་གི་ལུས་མཚན་གྱིས་བརྒྱན་པ་མཐོང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཅིག །
en: May all those beings who see my body adorned by signs all definitely attain the highest, most complete enlightenment.

source: སེམས་ཅན་དེ་དག་བྱང་ཆུབ་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མི་འབྲལ་བར་འགྱུར་ཞིང་དེར་དབང་པོ་རྣམས་མ་ཚང་བར་མ་གྱུར་ཅིག །
en: Until they attain enlightenment and nirvāṇa, may those beings never be apart from the bhagavat buddhas and never have deficient faculties. “ ‘

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བདག་ལ་ལྟ་བར་འཚལ་བ་དེ་དག་གང་དང་གང་དུ་མཆི་བ་དང་། སླར་ལྡོག་པ་དང་། འཆག་པ་དང་། འགྲེང་བ་དང་། མཆིས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཡིད་ལ་བགྱིད་པའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བདག་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་མཆིས་པ་མཐོང་བར་གྱུར་ཅིག །
en: May all the bodhisattvas there who wish to see me, as soon as they think of me, whether they are going, returning, walking, sitting, or standing, see me at the foot of the Bodhi tree.

source: མཐོང་ནས་ཀྱང་གང་དག་ཆོས་ལ་ཐེ་ཙོམ་དུ་གྱུར་པ་དེས་མཐོང་མ་ཐག་ཏུ་དེ་དང་བྲལ་བར་གྱུར་ནས།
en: May all those bodhisattvas who have doubts about the Dharma instantly be freed from them upon seeing me.

source: ཐེ་ཙོམ་ལས་གྲོལ་བར་གྱུར་ཅིང་ཆོས་ཀྱི་ཚིག་མ་བསྟན་པའི་དོན་ཀྱང་འཚལ་བར་གྱུར་ཅིག །
en: Freed from doubt, may they understand even the meaning of Dharma teachings that they have not received. “ ‘

source: བདག་གི་ཚེ་ནི་དཔག་ཏུ་མ་མཆིས་པར་གྱུར་ལ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་གཏོགས་པར་གཞན་སུས་ཀྱང་བགྲང་བར་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་ཀྱང་དཔག་ཏུ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May my lifespan be immeasurable, so that only those with omniscient wisdom can measure it, and may the bodhisattvas who will be there be innumerable.

source: སྐད་ཅིག་གང་ལ་བདག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོའི་བར་གྱི་སྐད་ཅིག་དེ་ཉིད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་སྐྲ་བྲེགས་ཤིང་ཆོས་གོས་ངུར་སྨྲིག་འཚལ་བ་ཤ་སྟག་འབྱུང་བར་གྱུར་ཅིག །
en: From the instant that I attain the complete enlightenment of perfect buddhahood until the instant I pass into the great nirvāṇa, may the bodhisattvas in that buddha realm all have shaved heads and wear saffron robes.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གཅིག་ཀྱང་སྐྲ་རིང་ཞིང་གོས་དཀར་པོ་འཚལ་བར་མི་འགྱུར་ལ་ཐམས་ཅད་ཀྱང་དགེ་སྦྱོང་གི་ཁ་དོག་ཏུ་འགྱུར་ཞིང་དགེ་སྦྱོང་གི་ཚུལ་དུ་གནས་པར་གྱུར་ཅིག །
en: May there not be one being in that buddha realm with long hair and white clothes, but may all wear the monastic color and remain monastic.’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavat said, ‘Worthy being, that is excellent, excellent.

source: །ཁྱོད་ཀྱང་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་ཡིན་ཏེ།
en: You are wise, learned, and intelligent.

source: ཁྱོད་ཀྱིས་ནི་སྨོན་ལམ་ཤིན་ཏུ་བཟང་པོར་བཏབ་བོ།
en: Your prayer is excellent. You have surpassing qualities.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ནི་ཤིན་ཏུ་ཡོན་ཏན་དང་ལྡན་ཞིང་ཤིན་ཏུ་ཡེ་ཤེས་དང་ལྡན་པས་ནི་གང་གི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་དེ་ལྟར་རབ་དང་མཆོག་གི་བློ་གྲོས་བཀྲ་ཤིས་པར་བྱས་ཤིང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་རབ་མཆོག་ཡོངས་སུ་བཟུང་བས་དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་འཇམ་དཔལ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: You have surpassing wisdom. Noble son, because you have created this kind of supreme, auspicious intention for the sake of all beings and have conceived of this supreme array of the qualities of a buddha realm, you will be named Mañjuśrī. “ ‘

source: འཇམ་དཔལ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་ནས་གྲངས་མེད་པ་གསུམ་པ་ལ་བབ་པ་ན་ལྷོ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་དག་པ་རྡུལ་བྲལ་ཡང་དག་བསགས་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ། དེར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱང་འདུས་ཤིང་ཁོངས་སུ་ཆུད་པར་འགྱུར་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་དེ་ལྟ་བུའི་ཡོན་ཏན་བཀོད་པ་འབྱུང་བར་འགྱུར་ཏེ།
en: Mañjuśrī, in the future, when two incalculable eons have passed, in which there are as many years as there are grains of sand in two Ganges Rivers, and there is a third such incalculable eon, there will be a world realm in the southern direction that is called Śuddhavi­rajaḥ­saṃnicaya in which the Sahā world realm will be included, and there will appear a buddha realm with those kinds of qualities. “ ‘

source: འཇམ་དཔལ་ཁྱོད་ནི་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་གཟིགས་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Mañjuśrī, there you will attain the complete enlightenment of complete buddhahood, and you will become the tathāgata arhat samyaksam­buddha named Samantadarśin. “ ‘

source: །ཁྱོད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཀྱང་དེ་ལྟ་བུར་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Your retinue of bodhisattvas will also be pure in that way.

source: །ཁྱོད་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་ལྟར་ཁྱོད་ཀྱི་སྨོན་ལམ་དེ་དག་ཐམས་ཅད་ཀྱང་འགྲུབ་པར་འགྱུར་ཏེ།
en: The prayers that you have made as a bodhisattva will all be accomplished.

source: དེ་བས་ན་ཁྱོད་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་མང་པོ་ལས་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ།
en: Therefore, you will be a bodhisattva who has generated good roots with many millions of buddhas.

source: །འཇམ་དཔལ་དེའི་ཕྱིར་ཁྱོད་ནི་སེམས་ཅན་རྣམས་ཀྱི་སྨན་ལྟ་བུར་འགྱུར་ཞིང་བསམ་པ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པར་འགྱུར་ལ།
en: Mañjuśrī, you will therefore be like a medicine for beings.

source: ཉོན་མོངས་པ་ཡོངས་སུ་འཇོམས་པར་བྱེད་པ་དང་། དགེ་བའི་ཕྱོགས་རྣམ་པར་འཕེལ་བར་བྱེད་པར་ཡང་འགྱུར་རོ།
en: You will have a completely purified motivation, your kleśas will be defeated, and your good qualities will have developed.’ “

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པའི་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་པ་རྣམས་ཀྱིས་བདག་ལུང་སྟོན་པར་མཛད་ཅིང་། དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ཀྱང་རབ་ཏུ་གཡོ་བར་གྱུར་ཅིག །
en: Mañjuśrī said, ‘Bhagavat, if these wishes of mine are to be fulfilled, may the bhagavat buddhas, who reside, live, and remain, teaching the Dharma to beings in realms in the ten directions that are as numerous as the grains of sand in the Ganges River, give me their prophecy, and may the countless, innumerable buddha realms shake.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན། བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གཉིས་པ་ལ་རྩེ་བའི་བཀོད་པ་ལ་སྙོམས་པར་ཞུགས་པ་དེ་ལྟ་བུའི་བདེ་བ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all beings have happiness that is like that of a bodhisattva resting in meditation at the apex of the second dhyāna.

source: དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ནས་ཀྱང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གི་ཆར་ཡང་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །མེ་ཏོག་མན་དཱ་ར་བ་དེ་དག་ལས་ཀྱང་འདི་ལྟ་བུའི་སྒྲ་འབྱུང་བར་གྱུར་ཅིག །འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་སྒྲ་དང་།
en: May there fall a rain of divine coral tree flowers from countless, innumerable buddha realms.

source: ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་སྒྲ་དང་། སྟོབས་དང་། མི་འཇིགས་པའི་སྒྲ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May these words sound from the coral tree flowers: the word Buddha, the word Dharma, the word Saṅgha, the word perfections, and the words strengths and fearlessnesses.

source: གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ་དེ་ལྟ་བུའི་མཚན་མ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May these signs appear when I bow the five parts of my body to the feet of the Bhagavat.’ “

source: གང་གི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་པ་དེའི་ཚེ་སྐད་ཅིག་དེ་ཉིད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་རབ་ཏུ་གཡོས། ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གི་ཆར་ཡང་རབ་ཏུ་བབ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་དེ་ལྟ་བུའི་བདེ་བ་དང་ལྡན་པར་གྱུར་པ་དང་།
en: When Mañjuśrī Kumārabhūta bowed down his head to the feet of the Bhagavat, the countless, innumerable buddha realms instantaneously shook; there fell a rain of divine coral tree flowers; and all beings gained the happiness that he had prayed for.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཆོས་ཉན་པ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་ན་འདི་ལྟ་བུའི་མཚན་མ་དག་བྱུང་བར་གྱུར་ཅེས་ཡོངས་སུ་ཞུས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་།
en: The bodhisattva mahāsattvas who were listening to Dharma teachings from the bhagavat buddhas asked them by what cause and circumstances these signs appeared, and the bhagavat buddhas gave the prophecy of Mañjuśrī Kumārabhūta’s attainment of the highest, most complete enlightenment. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་མཆོག་རབ་ཡངས་པའི་བློ་དང་ལྡན་པ་ལོངས།
en: The Bhagavat said: “ ‘Arise, you who have supreme intelligence and a vast intellect.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་མགོན་པོ་རྣམས་ཀྱིས་ཁྱོད་ལུང་བསྟན།
en: You have received a prophecy from the world guardians in the ten directions.

source: །ས་གཡོས་སེམས་ཅན་རྣམས་ཀྱང་བདེ་བས་ཚིམ་པར་གྱུར། །མེ་ཏོག་ཆར་པ་རབ་འབབ་འཇིག་རྟེན་སངས་རྒྱས་འགྱུར།། །།བམ་པོ་དྲུག་པ།
en: The earth shook, beings were satisfied by happiness, A rain of flowers fell—you will become a buddha in the world.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་བཞི་པ་ཉོན་མོངས་མེད་ཅེས་བྱ་བ་ལ་བོས་པ་དང་། ཇི་ལྟར་འཇམ་དཔལ་གྱིས་སྨོན་ལམ་བཏབ་པ་ལྟར་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: Then, noble son, the brahmin Samudrareṇu summoned the fourth prince, who was named Anaṅgaṇa, and like Mañjuśrī he made a prayer. “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Bhagavat said to him, ‘Excellent, excellent!

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གི་ཉོན་མོངས་པའི་རི་འཇོམས་པར་འགྱུར་ཞིང་།
en: Noble son, when you become a bodhisattva, you will destroy a mountain of kleśas in innumerable, countless beings.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བྱེད་པར་འགྱུར་ལ།
en: You will perform the deeds of a buddha and will attain the complete enlightenment of perfect buddhahood.

source: དེའི་འོག་ཏུ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བས་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་རྡོ་རྗེས་གཅོད་པའི་ཤེས་རབ་སྣང་བའི་དཔལ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: Therefore, noble son, you shall be named Vajraccheda­prajñā­vabhāsaśrī. “ ‘

source: རྡོ་རྗེས་གཅོད་པ་ཤེས་རབ་སྣང་བའི་དཔལ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མིག་མི་འཛུམས་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Vajraccheda­prajñā­vabhāsaśrī, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, there will be in the eastern direction, beyond buddha realms as numerous as the grains of sand in ten Ganges Rivers, a realm called Animiṣa. “ ‘

source: རིགས་ཀྱི་བུ་ཁྱོད་དེར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ།
en: Noble son, you will attain the complete enlightenment of perfect buddhahood there, and you will be the tathāgata arhat samyaksam­buddha named Samantabhadra, who has wisdom and virtuous conduct, who is a sugata, a knower of the world, a guide who tames beings, an unsurpassable teacher of gods and humans, a buddha, and a bhagavat.

source: །ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་ལྟ་བུའི་ཡོན་ཏན་བཀོད་པ་དུ་མ་དང་ལྡན་པར་འགྱུར་རོ།
en: Your buddha realm will have the manifold array of qualities that you have prayed for.’ “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས། བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་གཅོད་པ་ཤེས་རབ་སྣང་བའི་དཔལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་མ་ཐག་ཏུ་ནམ་མཁའི་དཀྱིལ་ནས་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་ཙན་དན་ས་མཆོག་པ་དང་།
en: Noble son, as soon as the Tathāgata Ratnagarbha prophesied to the bodhisattva Vajraccheda­prajñā­vabhāsaśrī his attainment of the highest, most complete enlightenment, there came from the center of the sky the sound of many hundreds of thousands of millions of trillions of devas saying ‘Excellent!’

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། ཨ་ག་རུ་དང་། རྒྱ་སྤོས་དང་། ཏ་མ་ལའི་ཕྱེ་མའི་ཆར་ཡང་རབ་ཏུ་ཕབ་བོ། །དེས་གསོལ་པ།
en: and it rained powders of gośīrṣa sandalwood, uragasāra sandalwood, agarwood, valerian, and bay leaf. “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ལྷའི་ལས་ཤིན་ཏུ་འདས་པའི་སྤོས་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཅིག །འཇིག་རྟེན་གྱི་ཁམས་དེར་སེམས་ཅན་དམྱལ་བ་པའམ། དུད་འགྲོའི་སྐྱེ་གནས་པའམ། གཤིན་རྗེའི་འཇིག་རྟེན་པའམ། ལྷའམ། མིའམ།
en: He said, ‘Bhadanta Bhagavat, if these wishes of mine are to be fulfilled in this way, then when I bow down the five parts of my body to the feet of the Bhagavat, may realms as numerous as the grains of sand in the Ganges River be pervaded by divine, wonderful, vast, extensive incense.

source: སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་དྲི་དེ་ཚོར་བར་འགྱུར་ཞིང་། ཇི་སྲིད་དུ་བདག་གི་མགོ་བོས་ལ་རེག་པ་དེ་སྲིད་དུ་དེ་དག་གི་ལུས་ཀྱི་ནད་དང་། ལུས་ཀྱི་སྡུག་བསྔལ་བ་དང་། སེམས་ཀྱི་ནད་དང་། སེམས་ཀྱི་སྡུག་བསྔལ་བ་དག་ཀྱང་མྱུར་དུ་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: May all the beings who have been born in those realms, whether as hell-beings, animals, those in Yāma’s land, devas, or humans, experience that scent, and when my head is touching the ground, may their physical illness, physical suffering, mental illness, and mental suffering quickly cease.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་གཅོད་པ་ཤེས་རབ་སྣང་བའི་དཔལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དང་། དེ་ནས་དེའི་མོད་ལ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཀྱང་ལྷའི་ལས་ཤིན་ཏུ་འདས་པའི་སྤོས་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་ནད་དང་། སེམས་ཀྱི་ནད་དང་། ལུས་ཀྱི་སྡུག་བསྔལ་དང་། སེམས་ཀྱི་སྡུག་བསྔལ་བ་ཡང་རབ་ཏུ་ཞི་ཞིང་རྒྱུན་ཆད་པར་གྱུར་པ་དང་།
en: Noble son, when Vajraccheda­prajñā­vabhāsaśrī bowed down the five parts of his body to the feet of the Tathāgata Ratnagarbha, at that moment, realms as numerous as the grains of sand in the Ganges River were pervaded by divine, wonderful, vast, extensive incense, and the physical illness, physical suffering, mental illness, and mental suffering of all beings quickly eased and ended. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྡོ་རྗེས་འཇོམས་པར་བྱེད་པ་ལོངས།
en: The Bhagavat said: “ ‘Arise, you who split a vajra.

source: །ཞིང་མང་སྤོས་ཀྱིས་ཁྱབ་གྱུར་ཏེ། །སེམས་ཅན་བདེ་དང་དགའ་བྱེད་པ། །འཇིག་རྟེན་མཆོག་གི་ཡབ་ཏུ་འགྱུར།
en: Many worlds have been pervaded by incense, Beings have been made blissful and happy— You will become a supreme father for the world.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་ལྔ་པ་འཇིགས་མེད་ཅེས་བྱ་བ་ལ་ཡང་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: Then, noble son, the brahmin Samudrareṇu summoned the fifth prince, who was named Abhaya, and he prayed as the others had. “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདི་འབའ་ཞིག་ཏུ་མ་ལགས་ཀྱི་གང་ན་སེམས་ཅན་དམྱལ་བ་མ་མཆིས་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་མ་མཆིས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་མ་མཆིས་པར་འགྱུར་བ་དང་། གང་ནས་གཞི་བཻ་དཱུརྱ་སྔོན་པོ་ལས་གྲུབ་པར་འགྱུར་བ་དང་། རྒྱ་ཆེར་ནི་འཇིག་རྟེན་གྱི་ཁམས་པད་མའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཇི་ལྟ་བུ་དེ་ལྟར་བརྗོད་པར་བྱ་སྟེ།
en: He said, ‘Bhadanta Bhagavat, my buddha realm will not be like this afflicted buddha realm, but one in which there are no hells, there are no animals, and there is no land of Yama; one where the ground is made of blue beryl; and one that is vast just like the array of buddha-realm qualities in the Padmā world realm, which I shall describe.

source: དེར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱིའོ་ཞེས་རྒྱལ་བུ་འཇིགས་མེད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་པད་མ་བཞག་སྟེ་གསོལ་པ།
en: That is where I shall attain the complete enlightenment of perfect buddhahood.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་བདག་གིས་ཏིང་ངེ་འཛིན་བཀོད་པ་སྣང་བ་ཞེས་བགྱི་བ་ཐོབ་པར་འགྱུར་ཞིང་། དེས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་པད་མ་ཤིང་རྟའི་ཕང་ལོ་ཙམ་པའི་མེ་ཏོག་གི་ཆར་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་རབ་ཏུ་འབེབས་པར་འགྱུར་ལ། བདག་གིས་ཀྱང་མཐོང་བར་གྱུར་ཅིག །
en: Then Prince Abhaya placed lotuses in front of the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, if these wishes of mine are to be fulfilled in this way, then through the power of the Bhagavat may I attain the vision array samādhi, and thereby may the Bhagavat see before him, in worlds in the ten directions as numerous as the grains of sand in the Ganges River, a rainfall of lotus flowers that are the size of chariot wheels and as numerous as the particles in a buddha realm, and may I also see them.’ “

source: ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་ཏིང་ངེ་འཛིན་སྣང་བ་བཀོད་པ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་པད་མ་ཤིང་རྟའི་ཕང་ལོ་ཙམ་པའི་མེ་ཏོག་གི་ཆར་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཀྱང་རབ་ཏུ་བབ་པར་གྱུར་ཏོ།
en: As soon as he said those words, through the power of the Buddha, he attained the vision array samādhi, and in worlds in the ten directions as numerous as the grains of sand in the Ganges River there fell a rain of lotus flowers the size of chariot wheels and as numerous as the particles in a buddha realm.

source: །རྒྱལ་བུ་གཞོན་ནུ་འཇིགས་མེད་ཀྱིས་དེ་མཐོང་ནས་ཤིན་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ཏོ།
en: Prince Abhaya saw this and was overjoyed and blissful. “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ནི་ཤིན་ཏུ་སྨོན་ལམ་བཟང་པོ་བཏབ་སྟེ།
en: The Bhagavat said, ‘Noble son, you have made an excellent prayer.

source: སངས་རྒྱས་ཀྱི་ཞིང་བཟང་པོ་ཡང་ཡོངས་སུ་བླངས། ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་ཀྱང་ཤིན་ཏུ་མྱུར་བར་ཐོབ། བདེན་པའི་ཚིག་གིས་པད་མའི་ཆར་ཡང་རབ་ཏུ་བབ་བོ། །དེས་གསོལ་པ།
en: You have acquired an excellent buddha realm, you have also attained samādhi very quickly, and through the power of true words there has fallen a rain of lotuses.’ “

source: གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་པད་མ་འདི་དག་ནམ་མཁའ་ལ་གནས་པར་གྱུར་ལ། དེ་ལྟར་ནམ་མཁའ་ལ་གནས་ནས་ཆར་བཞིན་དུ་ཡང་བབ་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The prince said, ‘If my hopes for the highest, most complete enlightenment are to be fulfilled, may these lotuses be suspended in the sky, and when they have floated in the sky, may they then fall like rain.’ “

source: རིགས་ཀྱི་བུ་ནམ་མཁའ་ལ་པད་མ་དག་གིས་ཤིན་ཏུ་མྱུར་བར་རྒྱས་བཏབ་པས་ན་དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱང་ནམ་མཁའི་ཕྱག་རྒྱ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: The Bhagavat said, ‘Noble son, very quickly the sky was sealed with the lotuses. Therefore, noble son, your name will be Gaganamudra.
